#Напишите программу, которая будет преобразовывать десятичное число
#в двоичное.
#Пример:
#- 45 -> 101101
#- 3 -> 11
#- 2 -> 10

#p.s. также можно было использовать ф-цию bin

NumberA = int(input('Напиши десятичное число: '))# Переменная, которую надо перевести
NumberB = ""# Переменная, куда запишем двоичное число

while NumberA > 0:
    # Находим двоичное число с помощью деления на 2. Число которое получили после деления на 2
    # также делим в следующей операции. Делить заканчиваем, когда от числа остается 0. Остатки
    # собираем в двоичное число
    NumberB = str(NumberA % 2) + NumberB
    NumberA = NumberA // 2

print(NumberB)

