#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
#Пример:
#- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

from random import randint

number = int(input('Введите размер списка '))
list = []
for i in range(number):
    list.append(randint(0, 9))
#Делаю срез списка для поиска нужных чисел
l = list[1::2]
#Суммирую числа, находящиеся на нужных позициях
summ = sum(l)

print("Дан список: ", list)
print ("На нечетных позициях:", l)
print("Ответ:", summ)